{
    "intro" : "I work as a Senior Software Engineer in the <a class=\"show_icon\" href=\"https://www.bloomberg.com/professional/product/multi-asset-risk-system/\" target=\"_blank\">Multi-Asset Risk System (MARS)</a> group at <a class=\"show_icon\" href=\"https://www.bloomberg.com/company/\" target=\"_blank\">Bloomberg L.P.</a><br/><br/>I graduated with MS and Ph.D. in Computer Engineering from the Electrical and Computer Engineering department at the Boston University. I worked as a doctoral research fellow in the <a class=\"show_icon\" href=\"http://sites.bu.edu/nislab/\" target=\"_blank\">Networking and Information Systems</a> lab under the supervision of Prof. <a class=\"show_icon\" href=\"https://www.bu.edu/eng/profile/david-starobinski/\" target=\"_blank\">Starobinski</a>. My research looked into the presence and effects of churn in the Bitcoin network. My latest paper characterized orphan transactions in the Bitcoin network, and studied the performance overhead incurred by varying the orphan transaction pool size. A link to download my Ph.D. thesis can be found at the bottom of this webpage.<br/><br/>Before joining Boston University, I worked as a Senior Software Development Engineer at <a class=\"show_icon\" href='https://www.mentor.com/' target='_blank'>Mentor Graphics</a>, now a Siemens business, for several years. I was responsible for development, maintanence and testing of several automotive network stacks including Mentor's legacy products and AUTOSAR MCALs written in embedded-C and C++.<br /><br />I received my B.Sc. in Electrical (Computer) Engineering from the <a class=\"show_icon\" href='http://nu.edu.pk/' target='_blank'>National University of Computer &amp; Emerging Sciences</a> at its Lahore campus. While at NUCES, I secured several accolades, including a <a class=\"show_icon\" href='http://nu.edu.pk/Campus/Lahore/MedalHolders' target='_blank'>silver medal</a> for obtaining second highest CGPA in my batch, and Cum Laude honors. I also made the <a class=\"show_icon\" href='http://nu.edu.pk/Campus/Lahore/DeanLists' target='_blank'>Dean's list</a> for all 8 semesters. My final year project won several competitions and a national research fund."
}